* Colors and Theme
#+begin_src emacs-lisp :load yes
;; Treat all themes as safe; no query before use.
(setf custom-safe-themes 't)
(setq frame-title-format nil)
#+end_src
** Emacs Theme
*** Leuven
Leuven is always a nice option, beautiful with Org Mode.
#+begin_src emacs-lisp :load no
(use-package leuven-theme
  :config
  (load-theme 'leuven-dark t))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (26250 43063 586916 0) :init (26250 43063 586914 0) :config (26250 43063 586907 0) :config-secs (0 0 6391 0) :init-secs (0 0 8900 0) :use-package-secs (0 2 807731 0)))

*** [[https://github.com/catppuccin/emacs][Catpuccin Theme]]
Trying this theme out for a little bit.
#+begin_src emacs-lisp :load yes
(use-package
 catppuccin-theme
 :config
 (load-theme 'catppuccin :no-confirm)
 (setq catppuccin-flavor 'frappe)
 (catppuccin-reload))
#+end_src
*** ef-day
I'm always changing my theme, but I tend to like light themes with yellow-ish backgrounds. Almost like handwriting with a yellow memo pad.
#+begin_src emacs-lisp :load no
(use-package ef-themes :config (load-theme 'ef-day t))
#+end_src
*** Gruvbox-dark
#+begin_src emacs-lisp :load no
(use-package
 gruvbox-theme
 :ensure t
 :config (load-theme 'gruvbox-dark-hard :no-confirm)
 ;; :after (centered-window-mode) :hook (centered-window-mode . cwm-update-fringe-background)
)
#+end_src
** Nano
#+begin_src emacs-lisp :load no
(use-package
 nano
 :straight
 (nano-emacs :type git :host github :repo "rougier/nano-emacs")
 :config (require 'nano))
#+end_src
** Colors in Dired
#+begin_src emacs-lisp :load no
(use-package rainbow-mode :hook (LaTeX-mode . rainbow-mode))
(use-package dired-hacks :hook (emacs-lisp-mode . rainbow-mode))
#+end_src
** Catch if running centered-window-mode
This may be needed to set the fringe to the new background color. Run it when startup is finished.
#+begin_src emacs-lisp :load yes
(add-hook 'emacs-startup-hook
          (lambda ()
            (when (fboundp 'cwm-update-fringe-background)
              (cwm-update-fringe-background))))
#+end_src
